Revit 2027 API
BuiltInFailures.CurtainWallFailures.AdjustEndCurtainWallParameterNoCorners Property
 Can't put Corner Mullion at end joined to non-Curtain Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AdjustEndCurtainWallParameterNoCorners { get; }
Public Shared ReadOnly Property AdjustEndCurtainWallParameterNoCorners As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AdjustEndCurtainWallParameterNoCorners {
	FailureDefinitionId^ get ();
}
static member AdjustEndCurtainWallParameterNoCorners : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace